; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

    (:action dead-end-stack
  	     :parameters (?x - block ?y - block)
  	     :precondition (and (holding ?x) (clear ?y))
  	     :effect
  	     (and (not (holding ?x))
  		   (not (clear ?y))
  		   (clear ?x)
  		   ;; REMOVED: (handempty)
  		   (on ?x ?y)
  		 ))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks-20-0)
(:domain blocks)
(:objects
    DUMMY1
    DUMMY2
    T
    S
    R
    Q
    P
    O
    N
    M
    L
    K
    J
    I
    H
    G
    F
    E
    D
    C
    A
    B
 - block)
(:init
    (CLEAR S)
    (CLEAR N)
    (CLEAR P)
    (ONTABLE H)
    (ONTABLE N)
    (ONTABLE K)
    (ON S C)
    (ON C M)
    (ON M Q)
    (ON Q B)
    (ON B T)
    (ON T J)
    (ON J L)
    (ON L E)
    (ON E I)
    (ON I O)
    (ON O G)
    (ON G F)
    (ON F A)
    (ON A D)
    (ON D H)
    (ON P R)
    (ON R K)
    (HANDEMPTY)
)
(:goal (and
    (ON K E)
    (ON E N)
    (ON N R)
    (ON R D)
    (ON D G)
    (ON G H)
    (ON H O)
    (ON O A)
    (ON A L)
    (ON L J)
    (ON J F)
    (ON F M)
    (ON M I)
    (ON I Q)
    (ON Q B)
    (ON B P)
    (ON P T)
    (ON T S)
    (ON S C)
)
)
)

; plan
1. (unstack s c)
   deleted: (clear s) (handempty) (on s c)
   added: (holding s) (clear c)
   goals met: 1 of 19
2. (stack s n)
   deleted: (holding s) (clear n)
   added: (clear s) (handempty) (on s n)
   goals met: 1 of 19
3. (unstack c m)
   deleted: (clear c) (handempty) (on c m)
   added: (holding c) (clear m)
   goals met: 1 of 19
4. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 1 of 19
5. (unstack s n)
   deleted: (clear s) (handempty) (on s n)
   added: (holding s) (clear n)
   goals met: 1 of 19
6. (stack s c)
   deleted: (holding s) (clear c)
   added: (clear s) (handempty) (on s c)
   goals met: 2 of 19
7. (unstack m q)
   deleted: (clear m) (handempty) (on m q)
   added: (holding m) (clear q)
   goals met: 2 of 19
8. (stack m n)
   deleted: (holding m) (clear n)
   added: (clear m) (handempty) (on m n)
   goals met: 2 of 19
9. (unstack q b)
   deleted: (clear q) (handempty) (on q b)
   added: (holding q) (clear b)
   goals met: 1 of 19
10. (stack q m)
   deleted: (holding q) (clear m)
   added: (clear q) (handempty) (on q m)
   goals met: 1 of 19
11. (unstack b t)
   deleted: (clear b) (handempty) (on b t)
   added: (holding b) (clear t)
   goals met: 1 of 19
12. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 2 of 19
13. (unstack t j)
   deleted: (clear t) (handempty) (on t j)
   added: (holding t) (clear j)
   goals met: 2 of 19
14. (stack t s)
   deleted: (holding t) (clear s)
   added: (clear t) (handempty) (on t s)
   goals met: 3 of 19
15. (unstack b p)
   deleted: (clear b) (handempty) (on b p)
   added: (holding b) (clear p)
   goals met: 2 of 19
16. (stack b j)
   deleted: (holding b) (clear j)
   added: (clear b) (handempty) (on b j)
   goals met: 2 of 19
17. (unstack p r)
   deleted: (clear p) (handempty) (on p r)
   added: (holding p) (clear r)
   goals met: 2 of 19
18. (stack p t)
   deleted: (holding p) (clear t)
   added: (clear p) (handempty) (on p t)
   goals met: 3 of 19
19. (unstack b j)
   deleted: (clear b) (handempty) (on b j)
   added: (holding b) (clear j)
   goals met: 3 of 19
20. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 4 of 19
21. (unstack q m)
   deleted: (clear q) (handempty) (on q m)
   added: (holding q) (clear m)
   goals met: 4 of 19
22. (stack q b)
   deleted: (holding q) (clear b)
   added: (clear q) (handempty) (on q b)
   goals met: 5 of 19
23. (unstack j l)
   deleted: (clear j) (handempty) (on j l)
   added: (holding j) (clear l)
   goals met: 5 of 19
24. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 5 of 19
25. (unstack l e)
   deleted: (clear l) (handempty) (on l e)
   added: (holding l) (clear e)
   goals met: 5 of 19
26. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 6 of 19
27. (unstack e i)
   deleted: (clear e) (handempty) (on e i)
   added: (holding e) (clear i)
   goals met: 6 of 19
28. (stack e l)
   deleted: (holding e) (clear l)
   added: (clear e) (handempty) (on e l)
   goals met: 6 of 19
29. (unstack i o)
   deleted: (clear i) (handempty) (on i o)
   added: (holding i) (clear o)
   goals met: 6 of 19
30. (stack i q)
   deleted: (holding i) (clear q)
   added: (clear i) (handempty) (on i q)
   goals met: 7 of 19
31. (unstack m n)
   deleted: (clear m) (handempty) (on m n)
   added: (holding m) (clear n)
   goals met: 7 of 19
32. (stack m i)
   deleted: (holding m) (clear i)
   added: (clear m) (handempty) (on m i)
   goals met: 8 of 19
33. (unstack o g)
   deleted: (clear o) (handempty) (on o g)
   added: (holding o) (clear g)
   goals met: 8 of 19
34. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 8 of 19
35. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 8 of 19
36. (stack g e)
   deleted: (holding g) (clear e)
   added: (clear g) (handempty) (on g e)
   goals met: 8 of 19
37. (unstack f a)
   deleted: (clear f) (handempty) (on f a)
   added: (holding f) (clear a)
   goals met: 8 of 19
38. (stack f m)
   deleted: (holding f) (clear m)
   added: (clear f) (handempty) (on f m)
   goals met: 9 of 19
39. (unstack a d)
   deleted: (clear a) (handempty) (on a d)
   added: (holding a) (clear d)
   goals met: 9 of 19
40. (stack a f)
   deleted: (holding a) (clear f)
   added: (clear a) (handempty) (on a f)
   goals met: 9 of 19
41. (unstack r k)
   deleted: (clear r) (handempty) (on r k)
   added: (holding r) (clear k)
   goals met: 9 of 19
42. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 10 of 19
43. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 10 of 19
44. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 11 of 19
45. (unstack a f)
   deleted: (clear a) (handempty) (on a f)
   added: (holding a) (clear f)
   goals met: 11 of 19
46. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 11 of 19
47. (unstack g e)
   deleted: (clear g) (handempty) (on g e)
   added: (holding g) (clear e)
   goals met: 11 of 19
48. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 11 of 19
49. (unstack e l)
   deleted: (clear e) (handempty) (on e l)
   added: (holding e) (clear l)
   goals met: 11 of 19
50. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 12 of 19
51. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 12 of 19
52. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 13 of 19
53. (unstack l j)
   deleted: (clear l) (handempty) (on l j)
   added: (holding l) (clear j)
   goals met: 12 of 19
54. (stack l k)
   deleted: (holding l) (clear k)
   added: (clear l) (handempty) (on l k)
   goals met: 12 of 19
55. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 12 of 19
56. (stack j f)
   deleted: (holding j) (clear f)
   added: (clear j) (handempty) (on j f)
   goals met: 13 of 19
57. (unstack l k)
   deleted: (clear l) (handempty) (on l k)
   added: (holding l) (clear k)
   goals met: 13 of 19
58. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 14 of 19
59. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 14 of 19
60. (stack a l)
   deleted: (holding a) (clear l)
   added: (clear a) (handempty) (on a l)
   goals met: 15 of 19
61. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 15 of 19
62. (stack o a)
   deleted: (holding o) (clear a)
   added: (clear o) (handempty) (on o a)
   goals met: 16 of 19
63. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 15 of 19
64. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 15 of 19
65. (unstack e n)
   deleted: (clear e) (handempty) (on e n)
   added: (holding e) (clear n)
   goals met: 14 of 19
66. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 14 of 19
67. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 14 of 19
68. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 15 of 19
69. (unstack n r)
   deleted: (clear n) (handempty) (on n r)
   added: (holding n) (clear r)
   goals met: 14 of 19
70. (stack n k)
   deleted: (holding n) (clear k)
   added: (clear n) (handempty) (on n k)
   goals met: 14 of 19
71. (unstack r d)
   deleted: (clear r) (handempty) (on r d)
   added: (holding r) (clear d)
   goals met: 13 of 19
72. (stack r g)
   deleted: (holding r) (clear g)
   added: (clear r) (handempty) (on r g)
   goals met: 13 of 19
73. (unstack d h)
   deleted: (clear d) (handempty) (on d h)
   added: (holding d) (clear h)
   goals met: 13 of 19
74. (stack d n)
   deleted: (holding d) (clear n)
   added: (clear d) (handempty) (on d n)
   goals met: 13 of 19
75. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 13 of 19
76. (stack h o)
   deleted: (holding h) (clear o)
   added: (clear h) (handempty) (on h o)
   goals met: 14 of 19
77. (unstack r g)
   deleted: (clear r) (handempty) (on r g)
   added: (holding r) (clear g)
   goals met: 14 of 19
78. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 15 of 19
79. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 15 of 19
80. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 16 of 19
81. (unstack r d)
   deleted: (clear r) (handempty) (on r d)
   added: (holding r) (clear d)
   goals met: 15 of 19
82. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 15 of 19
83. (unstack d n)
   deleted: (clear d) (handempty) (on d n)
   added: (holding d) (clear n)
   goals met: 15 of 19
84. (stack d g)
   deleted: (holding d) (clear g)
   added: (clear d) (handempty) (on d g)
   goals met: 16 of 19
85. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 16 of 19
86. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 17 of 19
87. (unstack n k)
   deleted: (clear n) (handempty) (on n k)
   added: (holding n) (clear k)
   goals met: 17 of 19
88. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 18 of 19
89. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 17 of 19
90. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 17 of 19
91. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 17 of 19
92. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 18 of 19
93. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 18 of 19
94. (dead-end-stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (on k e)
   goals met: 19 of 19
